/*
 * ============================================================================
 *
 *       Filename:  27_Min_Casting.cpp
 *
 *    Description:  本节主题是尽量少做转型动作。
 *    有个地方提到，类型转换，不仅仅是告诉编译器，把A当作B来看待。可能做了很多
 *    你不知道的事情，比如，下面这个例子，pb的值可能和&d的值不一样。我测试一下
 *    看是否不一样。运行结果是，二者的值是一样的。我不能解释这件事。原因是，
 *    发生不一样的条件没有满足。
 *
 *        Version:  1.0
 *        Created:  11/02/12 11:29:25
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  lxf (), 
 *        Company:  NDSL
 *
 * ============================================================================
 */
#include    "../my.h"

int main()
{
    Drived d;
    Base* pb = &d;
    cout<<"d's addr:"<<&d<<endl;
    cout<<"pb:"<<pb<<endl;
}
