/*
 * ============================================================================
 *
 *       Filename:  main.c
 *
 *    Description:  C陷阱与缺陷
 *
 *        Version:  1.0
 *        Created:  12/03/2012 10:36:09 PM
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  lxf (), 
 *        Company:  NDSL
 *
 * ============================================================================
 */
#include    <stdio.h>

int main()
{
    char a = 'yes';
    //单引号引起的字符就是一个整数，因此，'a'和97（十进制）严格一致。
    //但，向上面这种情况：a='yes'; a的值依赖于不同编译器的实现。gcc的实现是：
    //a='s'就是单引号引起的字符中最后一个的值。
    printf("a:%d\n", a);
    return 0;
}
